[
     {

 "id": 0, "make": "Bentley", "model": "Bentayga", "year": "2023", "description": "The term 'connoisseur' is defined as an expert judge in matters of taste, and motoring connoisseurs hold automakers like Bentley and Rolls-Royce in the highest regard as the personification of class and style. With so much focus on SUVs and crossovers of late, it's no wonder these power brands have stepped up to the plate. The new Bentaya SUV brings eminent practicality and superfluous comfort to the table - but, seated alongside rivals like the Lamborghini Urus and Rolls-Royce Cullinan, it has to remain on its toes to shine in the ultra-luxury segment.So Bentley puts in the work and presents buyers with a modern, family-oriented SUV that is now available with an extended wheelbase, seating up to seven. It comes flush with luxuries and comforts typical of the brand and can be powered by various powerful engines, including a 626-horsepower W12 and a hybrid V6 with 443 hp. While it's not the most beautiful to look at, the Bentayga's spacious and plush cabin are streets ahead of what you'd find on more mainstream cars. But is it enough to dominate in the segment?",  "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/10000/700/10732.jpg"

},

{

    "id": 1, "make": "Bently", "model": "Bentayga Hybrid", "year": "2023", "description": "To compete with the likes of Rolls-Royce is no easy thing, and Bentley has done it for ages; but whereas Rolls-Royce has seemingly gone all in with its strategy to move to electrification right away, Bentley is taking a more considered approach. Enter the Bentley Bentayga Hybrid. The respected British marque launched the hybrid SUV in 2019, and judging by the fact that the 2023 Bentayga Hybrid lineup has grown from one model to four, it's doing something right.A 3.0-liter V6 engine does duty, paired with an electric motor for combined outputs of 456 horsepower and 516 lb-ft of torque, which is enough to get the Bentayga Hybrid to 60 mph in just over five seconds. These outputs are on par with the Porsche Cayenne E-Hybrid, but the German SUV gets up to speed a lot quicker. It also starts at an MSRP that's half of what the Bentayga Hybrid asks for. There aren't currently other ultra-luxury competitors to the Bentley Bentayga PHEV, so it's likely that those shopping under the Flying B banner have already decided to buy one - and there aren't all that many reasons, barring a hefty price tag, to dissuade them.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/9000/900/9997.jpg"

},

{
"id": 2, "make": "Porsche", "model": "Taycan Turbo", "year": "2023", "description": "Purist, expressive, timeless. Three attributes that describe every Porsche – and especially this one, which takes our DNA into a new automotive era.", "price": "Call for price.", "url": "https://files.porsche.com/filestore/image/multimedia/none/j1-taycan-tu-modelimage-sideshot/thumbwhite/4c81bd61-1f25-11ee-8103-005056bbdc38;sK;tjpeg060/porsche-thumbwhite.jpg"

},

{

"id": 3, "make": "Porsche", "model": "Taycan Turbo S", "year": "2023", "description": "Purist, expressive, timeless. Three attributes that describe every Porsche – and especially this one, which takes our DNA into a new automotive era.", "price": "Call for price", "url": "https://files.porsche.com/filestore/image/multimedia/none/j1-taycan-tu-s-modelimage-sideshot/thumbwhite/5acd794a-1f25-11ee-8103-005056bbdc38;sK;tjpeg060/porsche-thumbwhite.jpg"

},

{    	 
"id": 4, "make": "Bentley", "model": "Continental GT", "year": "2023", "description": "The ultimate expression of status and class in the automotive world has wings, and in the case of sleek grand tourers, the Bentley Continental GT is right up there with big names from Aston Martin and Rolls Royce. The Continental GT is arguably the quintessential Bentley, boasting exquisite style, opulent accommodations, and a sublime ride - with or without a roof. The new Bentley Continental GT Coupe is the one to get if you're after power, prestige, and a cabin you could spend hours in. Under the shapely hood, you'll find a 4.0-liter twin-turbo V8 engine producing 542 hp and 568 lb-ft of torque, which allows this big British battleship to reach 60 mph in just 3.9 seconds. That's impressive, considering the weight behind the Conti GT is not just a result of its pedigree - it's a heavy beast that manages to be fun to drive, not just be driven in. But with competition from other heavyweights such as the BMW M8, Aston Martin DBS, and even the mighty Rolls-Royce Wraith, is the Continental GT still worth forking over upwards of $235k?", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/8000/200/8288.jpg"

},

{

"id": 5, "make": "Cadilac", "model": "ESV", "year": "2023", "description": "The 2023 Cadillac Escalade ESV is a luxurious three-row SUV that boasts an extensive suite of standard and optional driver aids and an optional diesel.", "price": "Call for price", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/12000/500/12590.jpg"

},

{

"id": 6, "make": "Cadilac", "model": "Escalade SUV", "year": "2023", "description": "The 2023 Cadillac Escalade is a giant luxury SUV with advanced technology, many lavish features, and a very powerful engine.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/12000/500/12589.jpg"

},

{

"id": 7, "make": "Cadilac", "model": "SUV", "year": "2023", "description": "D", "price": "Call for price", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/13000/900/13997.jpg"

},

{

"id": 8, "make": "Lamborghini", "model": "Huracan Sterrato", "year": "2023", "description": "Soon, the Lamborghini Huracan will be no more, but the Italian marque wants to send this V10-powered beast off into the sunset with a bang - even if it takes a dirt road to get there. Enter the Lamborghini Huracan Sterrato, perhaps the wackiest iteration of the supercar yet with its raised suspension and dirt-road capability. Producing 602 horsepower, the Sterrato is not only devastatingly quick, but it comes with specially calibrated drive modes to tackle low-grip conditions. A skid plate, reinforced sills, and Bridgestone Dueler AT002 tires make for a Huracan that looks as insane as it is capable. Remarkably, the Sterrato was revealed mere weeks after another off-road supercar in the form of the Porsche 911 Dakar, creating a mini sports car niche that few could've envisioned. The Lambo is more exclusive and has a more evocative engine, though. It's also off-roading at its most unhinged, and we love it for that.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/400/14404.jpg"

},

{
 
"id": 9, "make": "Porsche", "model": "Panemera Turbo S EXecative", "year": "2023", "description": "Can a vision be logical? Is it even allowed to be? Probably not. We believe that the more visionary an idea at the start, the more exciting it is at the end. Then it's worth fighting for. That was the case with the Panamera. A sports car for four? With impressive performance and great comfort? With the dynamism typical of Porsche and simultaneously more efficient? Many said it was impossible. Others called it brave.", "price": "Call for price.", "url": "https://files.porsche.com/filestore/image/multimedia/none/971-g2-2nd-tus-e-modelimage-sideshot/thumbwhite/01cac518-d325-11ea-80cc-005056bbdc38;sK;tjpeg060/porsche-thumbwhite.jpg"

},

{

"id": 10, "make": "Lamborghini", "model": "Countach", "year": "2022", "description": "Throughout the year, Lamborghini has been effectively telling us that its focus for 2021 is the Countach. How could it not be? First, there were explanations of how the Countach inspires every current Lambo, and then there was a full tribute to the iconic poster car. In the car's 50th anniversary year, we've seen celebratory videos and stories galore, and these even inspired a render of what a modern Countach could look like. Although a great effort, Lamborghini has now revealed what it thinks is a respectful homage to the original classic, and you know what? The Countach LPI 800-4 is just right. Let's dive in and see what this new masterpiece has to offer.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/11000/800/11873.jpg"

},

{

"id": 11, "make": "Testla", "model": "Model S Performance", "year": "2020", "description": "It's getting close to a decade since the Tesla Model S was introduced to the market as a gatecrasher to the traditional luxury sedan party. With its eye-popping acceleration and impressive range, tens of thousands of shoppers found it hard to resist. Sales have remained strong for years, until last year when Tesla moved 14,100 Model S units stateside, a drop of about 45 percent compared to the prior year. While the current Model S' appeal may be waning in some small ways, nothing about the Model S Performance's acceleration has aged in the slightest. The 0-60 mph time of 2.4 seconds for a luxury sedan still amazes, and it's paired with a practical (especially for an EV) range of nearly 350 miles. At $99,990, the Model S Performance has to do battle with the much newer Porsche Taycan. Despite the age difference, the Model S Performance still comfortably outperforms the price-comparable Taycan 4S, so for now, Tesla's largest sedan still has a lot going for it.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/2000/200/2228.jpg"

},

{

"id": 12, "make": "Testla", "model": "Model S", "year": "2023", "description": "Tesla remains the leading EV manufacturer globally, and its crown jewel is the Model S. This full-size sedan/hatchback chimera, along with its smaller sibling, the Model 3, is one of the most popular EVs on American roads and continues to make believers of hardened gearheads with ludicrous levels of acceleration, massive range, and luxury. It's hard to believe that the Model S has been around for over a decade; this EV continues to push the boundaries of what we previously thought EVs were capable of, and with constant minor tweaks and updates, it feels as fresh as ever. With over 400 miles of range, and a 0-60 mph time of just over three seconds, the 'long range' model is more than capable of taking on competitors such as the Porsche Taycan and Audi e-tron GT, while the Standard Range trim offers 320 miles and 491 hp - and a cheaper price. Stepping up to the 1,000-horsepower-plus Model S Plaid should come with a health and safety warning , but we review that Tesla Model S separately. Is the EV giant's most loved model still the champion of the electric car world?", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/12000/300/12317.jpg"

},

{

"id": 13, "make": "Testla", "model": "Model S Plaid", "year": "2023", "description": "The Tesla Model S started the mass EV shift more than a decade ago when it first launched in the USA as a 2012 model. It's been substantially improved and upgraded in the years since then, but Tesla's lineup has been aging as the automaker struggles to get new models to the market and postpones launch dates repeatedly. The Model S is still a force to be reckoned with, however, and the simply ballistic Plaid is the performance flagbearer that will rip off a two-second 0-60 run, leaving a bunch of hypercars in its wake. $105k is a lot of money for a Model S, but it's pocket change for this level of performance, and rivals such as the Lucid Air Sapphire that can match its muscle cost twice as much. The more expensive Porsche Taycan Turbo Cross Turismo is the closest thing Porsche has to the practical liftback Model S Plaid, but that can't hold a candle to the Tesla's straight-line speed. The Porsche is a much more accomplished driver's car, though, and you can actually take it on a dirt road. Should you still consider the Model S plaid? Let's find out.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/9000/900/9954.jpg"
},

{
"id": 14, "make": "Testla", "model": "Model X", "year": "2023", "description": "Tesla is still up there as the biggest EV manufacturer in the USA, but it's no longer undisputed as there are now more players catching up than ever before. The Tesla Model X, a luxury midsize crossover SUV, was once the go-to in this class, but with competitors such as the Rivian 1S and BMW iX entering the US market, massive power and impressive range become less compelling that's all you bring to the table to try to win over customers. Don't get us wrong, we love how quick the Model X is, especially in Plaid guise, where it produces over a thousand horsepower - so you need just 2.5 seconds to get to 60 mph. Even the 670-hp dual-motor base model can dispatch the benchmark sprint in 3.8 seconds. But when it comes to value for money, modern tech, and build quality, this once dominant player is starting to fall behind, and if Tesla doesn't up its game, the Model X might not be able to catch up.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/12000/300/12319.jpg"

},

{

"id": 15, "make": "Corvette", "model": "Z06 2LZ2-Door RWD", "year": "2023", "description": "American super car made and shiped from\nAmerica. This Chevrolette is the worlds\nhottest luxury car on the planet.\nIt's no holding back when you take the\nroad,corners and highways with\nthis", "price": "Call for price.", "url": "https://images.carprices.com/pricebooks_data/usa/colorized/2023/Chevrolet/View2/Corvette/2LZ/1YH67_GSJ.png"

},

{

"id": 16, "make": "Porche", "model": "911", "year": "2023","description": "Italain super car made and shiped from\nItaly. This Lamborghini is the worlds\nhottest luxury car on the planet.\nIt's no holding back when you take the\nroad,corners and highways with\nthis", "price": "Call for price.", "url": "https://edgecast-img.yahoo.net/mysterio/api/BA7D3E814CDCB3616CA252FE9886B82F7B7618B15D30B2116646D17CDA761B9C/autoblog/resizefill_w788_h525;quality_80;format_webp;cc_31536000;/https://s.aolcdn.com/commerce/autodata/images/USD10PRC011A021001.jpg"

},

{

"id": 17, "make": "Ford", "model": "Mustanf Mach-E", "year": "2023", "description": "When it was first launched, the Ford Mustang Mach-E stirred up a cloud of discontent about whether it warranted the Mustang nameplate, and the question is still lingering. In our previous reviews of the Ford Mustang Mach-E we noted that we felt it deserved the moniker, and while we still think it has a lot going for it, there is a new kid on the block that can't be ignored. Mach-E competitors aren't limited to the Tesla Model Y and the VW ID.4 anymore - the Hyundai Ioniq 5 joined the party, and we've fallen hard. And while these rivals are all excellent, they are lacking the weight of an iconic nameplate. The Mach-E is agile and sporty, and in Mach-E GT Performance Edition guise, it delivers a knockout punch with 480 horsepower, 634 lb-ft of torque, a 0-60 mph time of 3.5 seconds, and an impressive range of 314 miles. There are many other options too, with base models offering 266 hp. The waiting list for these cars is still long, proving they're more popular than ever.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/8000/400/8456.jpg"

},

{
"id": 18, "make": "Alfa Romeo", "model": "Tomale", "year": "2023", "description": "Italain super car made and shiped from\nItaly. This Alfa Romeo is the worlds\nhottest luxury car on the planet.\nIt's no holding back when you take the\nroad,corners and highways with\nthis", "price": "Call for price.", "url": "https://cdn.motor1.com/images/mgl/W81zWo/s1/2023-alfa-romeo-tonale-veloce-three-quarters-white-background.jpg"

},

{

"id": 19, "make": "Lamborghini", "model": "Urus", "year": "2022", "description": "With the growing popularity of the SUV, every luxury manufacturer from Aston Martin to Rolls-Royce has clamored to get one of their own on the market. If only they'd had the foresight to build one of these super-SUVs 30 years ago - Lamborghini did. At the time, the LM 002 was originally conceived as a military vehicle, but with an outrageous V12 from the Countach loaded under the hood, it quickly became sought after by sheiks and civilians alike, and could be outfitted in any number of opulent appointments you wanted. But the LM 002 was ahead of its time, and while it enjoyed some success, it was hardly the mass-market savior of the Lamborghini brand.", 
"price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/2000/300/2310.jpg"

},

{
"id": 20, "make": "Lamborghini", "model": "S", "year": "2023", "description": "The Lamborghini Urus is no more. As the original super SUV, the Urus was designed to upstage the automotive world by combining the elements of practicality with supercar performance. It certainly rocked the boat, but it also opened the doors for a whole segment that has since become quite popular, featuring fire-breathing sports utility vehicles from iconic marques, including Ferrari and Aston Martin, with the Purosangue and DBX variants, respectively. And, considering how the well-heeled flocked to buy these raucous family haulers, Lamborghini has taken the next logical step: dial the Urus up to eleven.Enter the Urus S and its Performante sibling. While the former takes over the torch from the regular Urus as the new base-level model as of 2023, the latter version of the Lamborghini Urus gets a separate review for its pure track-focused capabilities. Both are powered by a 4.0-liter twin-turbo V8 that makes 657 horsepower and 627 lb-ft of torque, but this is significant for the Urus S since it now represents the entry point to the range. The increase in power is just the tip of the iceberg.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/300/14344.jpg"

},

{

"id": 21, "make": "Lamborghini", "model": "Urus Performante", "year": "2023", "description": "In an effort to one-up its competitors in the high-performance midsize SUV segment, the new Lamborghini Urus Performante is the most focused iteration of the Urus yet. With the Aston Martin DBX707 here and the Ferrari Purosangue on the way - not to mention lesser German rivals like the BMW X5 M - the Performante aims to be the driver's choice in this crop of high-power, extravagant SUVs. Like the Urus S, the Performante gets a 4.0-liter twin-turbo V8 that has been tuned to deliver 657 horsepower, but because the Performante is lighter, it's even quicker. The 0-62 mph sprint is down to just 3.3 seconds, and it'll top out at over 190 mph. Sitting lower to the ground on a stiffened suspension, and with numerous aerodynamic tweaks and a new Rally mode, the Urus Performante handles and entertains in a manner that is more akin to a well-sorted sports car - whether on the track or on the dirt. At over $260,000 before options, it is a privilege that few can afford, and it's not as comfortable as a base Urus, but these flaws tend to melt into oblivion from the moment you fire up that V8.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/13000/800/13898.jpg"

},
				
{

"id": 22, "make": "Cadilac", "model": "Lyric", "year": "2024", "description": "The Lyriq is Cadillac's first attempt to make a fully electric midsize SUV, and after the automaker proved what it is capable of with the latest-gen Escalade, the world is expecting a lot from the EV. In terms of looks, the Lyriq doesn't disappoint; it's a very attractive vehicle that merges the futuristic elements of many current electric cars with the rugged design philosophy of the all-American brand. However, with 340 horsepower in its base guise, Caddy fanboys may not be all that impressed. This can be bumped up to a more impressive 500 hp if you opt for the all-wheel-drive version, and you only lose one mile of range over the RWD variant, leaving you with 307 miles on a full charge. Direct competitors to the Cadillac Lyriq are also fairly diverse, and buyers will want to look at the BMW iX or the Audi e-tron, and may even consider the Genesis GV60. Considering its pricing, spacious and stylish interior, and strong list of features, the Lyriq may just be another big win for Cadillac.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/12000/500/12585.jpg" 

},

{

"id": 23, "make": "Porsche", "model": "Cayan", "year": "2023", "description": "Electric motor.In the Cayenne E-Hybrid Coupe, the high system performance of 463 hp is achieved through the cooperation of the 3.0-liter V6 turbo engine and the new electric motor with 174 hp. The significantly increased power output of the electric motor allows for superior driving performance in e-power mode on the one hand, and greater support for the combustion engine on the other. The electric motor is powered by the new traction battery with 25.9 kW/h.", "price": "Call for price.", "url": "https://files.porsche.com/filestore/image/multimedia/none/e3-2nd-cayenne-coupe-tu-phev-modelimage-sideshot/thumbwhite/9471160d-5300-11ee-8107-005056bbdc38;sK;tjpeg060/porsche-thumbwhite.jpg"

},

{

"id": 24, "make": "BMW", "model": "7 series", "year": "2023", "description": "German super car made and shiped from\nGermani. This BMW is the worlds\nhottest luxury car on the planet.\nIt's no holding back when you take the\nroad,corners and highways with \nthis", "price": "Call for price.", "url": "https://cdn.motor1.com/images/mgl/P333Yy/s1/2023-bmw-7-series-the-first-edition-for-japan.jpg"

},

{

"id": 25, "make": "Maserati", "model": "Ghibli", "year": "2023", "description": "Maserati announced that the V8 engine will be phased out from the end of 2023, directly impacting the sedan you see here. The Maserati Ghibli Trofeo is the performance sedan in the mid-size Ghibli lineup, and its 3.8-liter twin-turbo V8 - along with ravishing stying and an equally inviting cabin - make it refreshingly different from the more powerful yet less individualistic Germans like the BMW M5 and Mercedes-AMG E63. Producing 572 horsepower and without the grippy all-wheel-drive systems of its rivals, the Maserati won't keep up with them off the line, but it remains an extremely quick and involving sedan. As a luxury car, the Ghibli suffers from having a few cheaper materials in its cabin and limited rear-seat space, but Maseratis have never promised to be the most sensible or practical vehicles around. They're about emotion above all else, but is that enough to recommend the Ghibli Trofeo right at the end of its life?", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/11000/800/11837.jpg"

},

{

"id": 26, "make": "Maserati Quattroporte", "model": "Quattroporte", "year": "2023", "description": "In last year's review of the Maserati Quattroporte, we lamented how it's starting to get very old - it's now been on sale in the USA for over a decade, after all. The Audi A8 and Mercedes-Benz S-Class were both redesigned in the last few years and there were two new generations of BMW 7 Series under the watch of the current Quattroporte. Now there's a 2023 Maserati Quattroporte, but it's virtually unchanged, sent right back into battle, firmly on its back foot. Sure, we love the Italianate charm and emotive styling, while the decade-old platform still provides sporty handling and has shown its worth underneath the Ghibli and Levante too. But with outputs ranging from 345 to 424 horsepower, its rivals outpunch it handsomely and it has a tough time justifying its substantially higher 2023 prices. Fans of the nameplate will have to wait until 2025 for an all-new Maserati Quattroporte large luxury sedan to arrive and it comes filled with the promise of the MC20's V6, an electric Folgore version, and brand-new tech. In the meantime, the old car has fallen out of contention and is now more of an emotional purchase than a rational one.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/11000/800/11844.jpg"

},

{

"id": 27, "make": "Maserati", "model": "MC20 Cielo", "year": "2023", "description": "Along with its coupe sibling, the Maserati MC20 Cielo drop-top is an exotic sports car out of Italy that aims to lure buyers with its mix of arresting styling and neck-snapping performance. The MC20 is Maserati's halo car that sets the standard for performance and design for the carmaker, and in Cielo guise, it's even more alluring. Although not quite as brash as the wildest Lamborghinis and Ferraris, the MC20 Cielo is still a sight to behold when those butterfly doors are open, and the 3.0-liter twin-turbocharged Nettuno V6 with 621 horsepower sounds better here since one can drop the roof at the touch of a button. A minimalist interior means nothing to distract you from the task of driving, and we also appreciate that the Cielo doesn't weigh much more than the coupe. The Cielo's price places it alongside rivals like the Aston Martin DB11 Volante and Ferrari Portofino M, both of which have V8 engines and guarantee an intoxicating driving experience. Can the latest MC20 Cielo match them?", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/13000/600/13685.jpg"

},

{ 

"id": 28, "make": "Lamborghini", "model": "Aventador Ultimae Roadster", "year": "2022", "description": "In the sports world, we often watch with fascination and mixed emotions as younger upstarts gradually take the place of enduring legends in the twilight of their careers. The Lamborghini Aventador Ultimae Roadster is a new car but feels a lot like an enduring legend, too - it's the last roadster from Lamborghini that will have a non-hybridized, naturally-aspirated V12. Although not a replacement for this car, the Sian Roadster plays the role of the newer, bolder, but more unfamiliar upstart as it has a hybridized V12. It's one of the first signs of what's to come from Lamborghini in an electrified era. But right at this moment, the Aventador Ultimae deserves our full attention.The 6.5-liter V12 makes 769 horsepower and will send this dramatic drop-top to 62 mph in only 2.9 seconds. It shares much with the already exceptional SVJ but is even more powerful. Both all-wheel drive and four-wheel steering work together to realize a machine that surprises with its precision. Its transmission can't match the dual-clutch in the Ferrari 812 GTS, and the McLaren 720S Spider is even better to drive, but the Lambo's theatrics and jaw-dropping looks are pure theater. Like LeBron James, Serena Williams, or Tiger Woods, the Aventador's bones may be aging but it won't go down without an almighty fight.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/11000/500/11528.jpg"

},

{  

"id": 29, "make": "Ferrari", "model": "Purosangue", "year": "2023", "description": "Italain super car made and shiped from\nItaly. This Ferrari is the worlds\nhottest luxury car on the planet.\nIt's no holding back when you take the\nroad,corners and highways with\nthis", "price": "Car price ", "url": "https://cdn.wheel-size.com/thumbs/35/db/35db5dcbb817964f590e72658b9e141c.jpg"

},

{

"id": 30, "make": "DB11 Coupe", "model": "Diablo", "description":  "Italain super car made and shiped from\nItaly. This Aston Martin is the worlds\nhottest luxury car on the planet.\nIt's no holding back when you take the\nroad,corners and highways with\nthis", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/12000/900/12921.jpg"

},

{

"id": 31, "make": "Lamborghini", "model": "Huracan STO", "year": "2023", "description": "Within the Huracan family hierarchy, the Lamborghini Huracan STO is firmly positioned at the top. This is an unabashed street-legal race car honed for track use, but if you absolutely must, you can also drive it to the mall if you want to turn mundane errands into memorable, hair-raising experiences. The most extreme Huracan uses a 5.2-liter V10 engine that's good for 631 horsepower and 417 lb-ft of torque. That's as much power as the new Huracan Tecnica, but the STO weighs 88 pounds less than that car in an effort to match the best RS Porsches and long-tail McLarens on the track. Like the 911 GT3 and McLaren 765LT, it's a strictly rear-wheel-drive beast, and in the most savage fashion imaginable, the STO will reach 62 mph in three seconds and a top speed of over 192 mph. It looks outrageous with extreme aero like the huge rear wing, and the new Trofeo mode will allow you to set blistering lap times if you know what you're doing. The Super Trofeo Omologata is a road-homologated supercar that you'll think about long after you've driven it for the first time.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/300/14348.jpg"

},  

{ 

"id": 32, "make": "Lamborghini", "model": "Huracan Tecnica", "year": "2023", "description": "Some heroes refuse to go gently into the night. In its farewell year now after a decade on the market, the 2023 Lamborghini Huracan Tecnica on review here is a not-so-gentle reminder that there's a fresh new trim of the brash Italian with the operatic tenor voice, and that it will be elbowing its way through the crowd and onto the stage once again for another rock-star performance. Conceived as an in-between car - a wilder Evo or a tamer STO, depending on your take - the 2023 Huracan Tecnica is a purist's delight. It has rear-wheel drive and its wailing 631-horsepower naturally aspirated V10 sitting just behind your right ear comes straight from the STO. So good does Lamborghini reckon the compromise is that they call it the 'perfect fun-to-drive Huracan'. The quarter-million-dollar price of the 2023 Lamborghini Huracan Tecnica puts it squarely in the sights of the more expensive Ferrari F8 Tributo and the cheaper Porsche 911 GT3 and GT3 RS. Has Lamborghini taught the old Huracan any new tricks?", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/300/14346.jpg"

},

{
		
"id": 33, "make": "Lamnorghini", "model": "Huracan Evo", "year": "2023", "description": "The Lamborghini Huracan Evo. An evolution of the already fantastic Huracan that was first introduced in 2014 to replace the Gallardo money-maker, the Huracan Evo is Lamborghini's 'most affordable' and daily drivable supercar. Starting with a price tag north of $200,000, Sant'Agata Bolognese's mid-engined exotic is fitted with a 5.2-liter V10 producing 630 horsepower and 443 lb-ft of torque. Sending power to all four wheels via a seven-speed dual-clutch automatic gearbox, the Huracan Evo can accelerate from 0-62 mph in 2.9 seconds (3.3 for the RWD), topping out at over 200 mph. The Huracan Evo makes driving gods out of mere mortals in much the same way that a Ferrari 488's Side Slip Angle Control system allows the hamfisted to slide into the next corner instead of into a Mustang's hunting grounds. For those more confident in their abilities, the Evo RWD sends a little less grunt (602 hp and 413 lb-ft) exclusively to the rear wheels.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/400/14406.jpg"

},

{

"id": 34, "make": "Lamborghini", "model": "Huracan Evo Spyder", "year": "2023", "description": "Following on from the Huracan Evo Coupe, the drop-top Spyder adds open-air thrills to one of the most exhilarating supercars on the road. Power comes from the same 5.2-liter V10 found in the Huracan Performante that produces 631 horsepower and 442 lb-ft of torque in the AWD version, with only a moderate drop in performance due to the extra weight of the Spyder with its lightweight soft-top. The 0-62 mph sprint passes by in a 3.1-second blur (just 0.2 seconds off the pace of the coupe) in the case of the AWD model, and the RWD version (with a detuned version of the V10) isn't far behind. The complex Lamborghini Integrated Vehicle Dynamics (LDVI) system expertly coordinates the car's dynamics based on parameters like driving mode and the conditions. Not only is it a spectacular driving machine, but the Evo's dramatic styling and eye-popping color options make every drive an event to remember. The Spyder versions of the Audi R8 and McLaren 600LT are direct competitors to the Huracan, but we're not sure that they're as outrageous to look at and to drive in, and it's the wildly gesticulating Italian that still has a way of turning the most heads.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/400/14408.jpg"

},

{  
 
"id": 35, "make": "Lamborhghini", "model": "Revuelto", "year": "2024", "description": "If the extremely exclusive Sian was Lamborghini giving us a taste of its electrified future, the Revuelto - a name that CarBuzz discovered as a trademark a year ago - is the full buffet. Codenamed LB744 and effectively replacing the Aventador Ultimae, the Revuelto is finally here.Whereas the Sian came with supercapacitor technology that saved weight but added tremendously to its price, the Revuelto uses a more conventional lithium-ion battery to create Lamborghini's first HPEV (High Performance Electrified Vehicle). With a new V12 and three electric motors, the Revuelto makes over 1,000 horsepower combined, edging even the magnificent Ferrari SF90 Stradale in that respect. Traditional Lamborghini traits like the scissor doors, elaborate styling, and high-revving V12 live alongside new facets to the Italian marque's mid-engined supercar formula, like an electric driving mode and a front structure made entirely from carbon fiber. It pushes the envelope in every sense, yet it appears that the Lambo DNA remains firmly intact.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/600/14652.jpg"

},

{  
		
"id": 36, "make": "Lamborghini", "model": "Aventador  Ultimae", "year": "2022", "description": "It's with a bittersweet disposition and reluctant fingers that we have to type up this review of the 2022 Lamborghini Aventador Ultimae. We don't need to tell you that the car itself is breathtaking, both to the eye and also via your spine, ears, and fingertips as you unleash the full potential of its 769-horsepower naturally-aspirated 6.5-liter masterpiece of an engine. Sadly, the Aventador Ultimae is both the final iteration of the Aventador and the last implementation of the iconic V12 on its own before it is inevitably bolstered by a hybrid system. But as a final hurrah, the Ultimae is something special, capable of hitting 62 mph in 2.8 seconds and continuing on to a top speed of over 220 mph. The more comfortable and practical Ferrari 812 Superfast provides similar power and performance from its own V12 engine, and yet it's a vastly different experience. It's the way the Lamborghini involves you in the action at every opportunity that is this car's most defining trait. There are downsides that betray the car's age, though, such as the flawed single-clutch automatic gearbox and the confining cabin. But as Lamborghini's last ICE-only supercar and the final incarnation of the Aventador, its legendary status is cemented.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/11000/500/11529.jpg"

},

{  
 		
"id": 37, "make": "Lamborghini", "model": "Aventador Ultimae Roadster", "year": "2022", "description": "In the sports world, we often watch with fascination and mixed emotions as younger upstarts gradually take the place of enduring legends in the twilight of their careers. The Lamborghini Aventador Ultimae Roadster is a new car but feels a lot like an enduring legend, too - it's the last roadster from Lamborghini that will have a non-hybridized, naturally-aspirated V12. Although not a replacement for this car, the Sian Roadster plays the role of the newer, bolder, but more unfamiliar upstart as it has a hybridized V12. It's one of the first signs of what's to come from Lamborghini in an electrified era. But right at this moment, the Aventador Ultimae deserves our full attention.The 6.5-liter V12 makes 769 horsepower and will send this dramatic drop-top to 62 mph in only 2.9 seconds. It shares much with the already exceptional SVJ but is even more powerful. Both all-wheel drive and four-wheel steering work together to realize a machine that surprises with its precision. Its transmission can't match the dual-clutch in the Ferrari 812 GTS, and the McLaren 720S Spider is even better to drive, but the Lambo's theatrics and jaw-dropping looks are pure theater. Like LeBron James, Serena Williams, or Tiger Woods, the Aventador's bones may be aging but it won't go down without an almighty fight.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/11000/500/11528.jpg"

},

{

"id": 38, "make": "Maserati", "model": "Grecale Trofeo", "year": "2023", "description": "The new Maserati Gracale Trofeo is the compact luxury crossover at the top of the Grecale range and its performance flagship. It has now gone on sale in the USA and its resume certainly makes for impressive reading. The car comes with a 523-horsepower version of the acclaimed Nettuno twin-turbocharged V6 engine first seen in the MC20 sports car, class-leading interior space, and excellent handling thanks to an adaptive air suspension and the Giorgio platform that does such a sterling job underneath the Alfa Romeo Stelvio. The Nettuno V6 gives the 2023 Grecale Trofeo blistering pace, propelling it to 60 mph in just 3.6 seconds - quick enough to leave the Porsche Macan GTS and BMW X3 M eating its dust. All of this is combined with a high-quality, tech-forward cabin and sultry looks, so it seems set to catapult right to the top rung of the podium, right? Well, with a steep $105k starting price, the new Maserati Grecale Trofeo is also a lot more expensive than these rivals, and this ambitious pricing strategy could prove to be its undoing.", "price": "Call for price.", "url": "https://cdn.carbuzz.com/car-thumbnails/700x375/14000/100/14144.jpg"

}
    
]
